
class Ikagaka
  ShioriJK = window["ShioriJK"]
  # new Ikagaka(nar:Nar):Ikagaka
  constructor: (@nar)->
    @named = null
    @ssp = null
    @shell = null
    @ghost = null
  # Ikagaka#materialize(shell:Shell, ghost:Ghost, callback:Function(err:Error|null, ikgk:Ikagaka):void):void
  materialize: (@shell, @ghost, callback)->
    @named = new Named(@shell)
    @element = @named.element
    @ssp = new SakuraScriptPlayer(@named)
    choice = (ary)-> ary[Math.round(Math.random()*(ary.length-1))]
    @ssp.play(choice([
      "\\1\\s[10]\\0\\s[43]\\w8\\w6\\w6イクサイスゼロ…\\w3\\s[77]参上っ！\\w6\\_w[72]\\n\\n[half]\\_w[6]\\1元気の良い事で。\\_w[48]\\e"
      "\\1\\s[10]\\0\\s[20]…\\w3…\\w3。\\_w[18]\\w8\\w6\\n\\n[half]\\_w[6]\\1剣爺殿、\\_w[24]ゼロは何処ですかな？\\w4\\_w[60]\\n\\n[half]\\_w[6]\\0「眠いって言っといて」との事ですよ。\\_w[108]\\w6\\n\\n[half]\\_w[6]\\1…\\w3…\\w3。\\_w[18]\\w8\\n\\s[11]たわけ！出て来んかっ！\\w8\\_w[66]\\n\\n[half]\\_w[6]\\0\\c\\s[4]…\\w3うー…\\w3。\\_w[30]\\w4ヒドイな～。\\_w[36]\\e"
      "\\1\\s[10]\\0\\s[51]\\w6\\w6\\s[5]はい、\\_w[18]お呼びですかご主人様っ！\\w6\\_w[72]\\n\\n[half]\\_w[6]\\1似合わない事はするんじゃないぞ？\\w6\\_w[96]\\n\\n[half]\\_w[6]\\0\\s[7]むー。\\_w[18]\\e"
      "\\1\\s[10]\\0\\s[43]\\w8\\w8\\w8\\s[0]到着ー。\\_w[24]\\w6\\n\\s[5]ユーザーさん、\\_w[18]こんちわー。\\_w[36]\\e"
      "\\1\\s[10]\\1ワシ参上。\\_w[30]\\w4\\n\\n[half]\\_w[6]\\0\\s[4]本物の年寄りに言われても…\\w3。\\_w[84]\\w4\\n\\n[half]\\_w[6]\\1萌えたじゃろ？\\w4\\_w[42]\\n\\n[half]\\_w[6]\\0\\s[0]いいや。\\_w[24]崩え。\\_w[18]\\w4\\n\\n[half]\\_w[6]\\1何じゃそれは…\\w3。\\_w[48]\\e"
      "\\0\\s[0]\\1\\s[10]\\1ゼロさんや。\\_w[36]\\w6\\n\\n[half]\\_w[6]\\0何？\\w6\\_w[12]\\n\\n[half]\\_w[6]\\1暑くないのかの？\\w6\\_w[48]\\n\\n[half]\\_w[6]\\0うん、\\_w[18]暑くないよ。\\_w[36]\\w2寒くも無いね。\\_w[42]\\w6\\nこの服は着用者も快適に保ってくれるんだよ。\\_w[126]\\w6\\n\\n[half]\\_w[6]\\1ほほー。\\_w[24]\\w6\\n\\n[half]\\_w[6]\\0エアコンが寒いとか暑いとか言ってたら変でしょ？\\w6\\_w[138]\\n\\n[half]\\_w[6]\\1確かに商品イメージにはかかわるかな？\\_w[108]\\n\\_w[654]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0そういえば、\\_w[36]荻月ってどうして年寄り言葉で話すの？\\w6\\_w[108]\\n\\n[half]\\_w[6]\\1魂がジジイじゃからな。\\_w[66]\\w6\\n\\n[half]\\_w[6]\\0\\_a[【ジジイの魂】]【ジジイの魂】\\_a？\\_w[48]\\n\\_w[288]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0実は料理とか鉱石精製とか趣味だよ。\\_w[102]\\w6\\n\\n[half]\\_w[6]\\1壊滅的にヘタクソじゃが。\\_w[72]\\w6\\n\\n[half]\\_w[6]\\0\\s[7]うるさいなー。\\_w[42]\\n\\_w[246]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0伝説の武器なんて、\\_w[54]世界の数だけあるんだから。\\_w[78]\\w6\\n…\\w3私のところに一本ぐらいあってもいいよね？\\w8\\_w[126]\\n\\n[half]\\_w[6]\\1そんな事言われてものぉ。\\_w[72]\\w8\\n\\n[half]\\_w[6]\\0という訳で、\\_w[36]\\s[5]アロンダイトカムヒアー！\\w6\\_w[108]\\n…\\w3なんてね。\\_w[36]\\w8\\n\\n[half]\\_w[6]\\1…\\w3危ないからコイツだけには渡したくないっていう場合もあるわけで。\\_w[192]\\w8\\n\\n[half]\\_w[6]\\0\\s[0]…\\w3失礼、\\_w[24]今何て。\\_w[24]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0燃料が増える…\\w3？　\\_w[54]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0陶芸にいそしむ荻月。\\_w[60]\\w4\\n\\n[half]\\_w[6]\\1いそしみません。\\_w[48]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0銃を持った相手に、\\_w[54]\\n\\s[7]動くなッ！\\w4\\_w[30]\\n動かないと撃つぞッ！\\w4\\_w[60]\\n\\n\\s[0]…\\w3って言われたらどうする？\\w6\\_w[78]\\n\\n[half]\\_w[6]\\1…\\w3ま、\\_w[18]動くかのぅ。\\_w[36]\\w6\\n\\n[half]\\_w[6]\\0ほぅ。\\_w[18]そのココロは？\\w6\\_w[42]\\n\\n[half]\\_w[6]\\1「動くな」の方では撃つとは言っていないからの。\\_w[138]\\nそれに動いてれば避けられるかもしれんじゃろ。\\_w[132]\\w4\\n\\n[half]\\_w[6]\\0ははぁ。\\_w[24]考えたね。\\_w[30]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0わたしの着てるこの服は、\\_w[72]\\_a[【イクサイスユニット】]【イクサイスユニット】\\_aって言うんだ。\\_w[108]\\w6\\n着用者に空調機能を付与するよ。\\_w[90]\\w6\\nユニットを着用して、\\_w[60]空調機能を自分の能力として使える状態になっている人のことを\\_a[【イクサイス】]【イクサイス】\\_aと呼ぶよ。\\_w[246]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0今精霊銀でこけしを作るのが流行っているんだよ。\\_w[174]\\w6\\n\\n[half]\\_w[6]\\1ほぉ。\\_w[18]どのくらい流行っておるのじゃ？\\w6\\_w[90]\\n\\n[half]\\_w[6]\\0\\s[5]全米Ｎｏ.１ＨＩＴ！ぐらいかな？\\w6\\_w[93]\\n\\n[half]\\_w[6]\\1…\\w3説得力が微塵も無くなったぞ。\\_w[90]\\n\\_w[471]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0荻月って、\\_w[30]学術っぽく言うとどんな分類になるの？\\w6\\_w[108]\\n\\n[half]\\_w[6]\\1有機微小精密機械集合式霊子付与擬似生命体…\\w3ってところかのぉ。\\_w[180]\\w8\\n適当じゃが。\\_w[36]\\w6\\n\\n[half]\\_w[6]\\0\\s[4]意味不明デス。\\_w[42]\\w6\\n\\n[half]\\_w[6]\\1有機ナノマシン集合体に、\\_w[72]魂をくっつけた生物です、\\_w[72]って感じじゃな。\\_w[48]\\w8\\n魂付与は錬金術的なものに頼ってるらしいから、\\_w[132]かなり正体不明じゃと思うがな。\\_w[90]\\w8\\n\\n[half]\\_w[6]\\0\\s[0]ＡＩじゃなかったんだ？\\w6\\_w[66]\\n\\n[half]\\_w[6]\\1ああ。\\_w[18]他の\\_a[【サポートユニット】]【サポートユニット】\\_aの連中は皆ＡＩじゃがな。\\_w[144]\\w6\\nお前さんの珍妙な能力に付き合うのはＡＩじゃ大変らしいゾ。\\_w[168]\\w6\\n\\n[half]\\_w[6]\\0\\s[7]誰が珍妙だってー？\\w6\\_w[54]\\n\\_w[1356]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0県名を技名として叫ぶとき、\\_w[78]埼玉県が一番語呂が良いよね。\\_w[84]\\w4\\n埼玉拳ーって。\\_w[42]\\w4何でだろうね？\\w4\\_w[42]\\n\\n[half]\\_w[6]\\1さぁのぅ…\\w3。\\_w[36]\\w4\\n\\n[half]\\_w[6]\\0…\\w3砕玉拳…\\w3？\\w4\\_w[36]\\n\\n[half]\\_w[6]\\1…\\w3！\\_w[12]\\n\\s[13]何を言い出すんじゃ！はしたない！\\_w[96]\\n\\n[half]\\_w[6]\\0\\s[2]え？え？…\\w3なんで？\\_w[54]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0\\_a[【イクサイス】]【イクサイス】\\_aの持つ基本的な能力は、\\_w[108]「空調機能」と「身体強化」だよ。\\_w[96]\\w6\\n\\n「空調機能」は文字通りエアコンとしての機能で、\\_w[138]着用者およびその周りの人に快適な空間をもたらす事が可能になるよ。\\_w[192]\\w8\\n\\n「身体強化」は、\\_w[48]外界の危険から着用者の安全を守るためのもので、\\_w[138]着用者の運動神経や防御力を着ている間ずっと向上させ続けるよ。\\_w[180]\\w8\\n\\n[half]\\_w[6]\\1どのくらい強くなるんじゃったかな？\\w6\\_w[102]\\n\\n[half]\\_w[6]\\0運動神経は、\\_w[36]通常時１００の力を出せる人が１２０の力を出せるようになるくらい。\\_w[192]\\w8\\n防御力は、\\_w[30]車にはねられても一応死なないくらいかな。\\_w[120]\\w6\\n\\n[half]\\_w[6]\\1凄い事は凄いが…\\w3微妙なラインじゃな。\\_w[108]\\e"
      "\\0\\s[0]\\1\\s[10]\\0ただ、\\_w[18]私の着ているユニットは、\\_w[72]\\_a[【Ｚ式】]【Ｚ式】\\_aっていうプロトタイプなんだ。\\_w[108]\\w8\\n一般に出回ってる量産型とは若干性能が違うよ。\\_w[132]\\w8\\n\\n[half]\\_w[6]\\1アレで若干と仰りマスカ。\\_w[72]\\w6\\n\\n[half]\\_w[6]\\0\\s[9]…\\w3露骨に戦闘能力あるもんね。\\_w[84]\\w6\\n\\n[half]\\_w[6]\\1どちらかというと戦闘能力の方がメインで、\\_w[120]エアコンはオマケに見えるんじゃが…\\w3。\\_w[108]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0病院の空気がたまらなく好き。\\_w[84]消毒用アルコールの匂いも好き。\\_w[90]\\w6\\n\\n[half]\\_w[6]\\1微妙に危なっかしい趣味ですな。\\_w[90]\\w8\\n\\n[half]\\_w[6]\\0ほら、\\_w[18]私\\_a[【アルビノ】]【アルビノ】\\_aだし、\\_w[60]イクサイスになる前は外出できない体だったでしょ？\\w8\\_w[144]\\n検査を受けに病院に行くのは、\\_w[84]唯一昼間に外出する機会だったから特別な印象があるんだ。\\_w[162]\\w6\\n\\n[half]\\_w[6]\\1ふむ…\\w3。\\_w[24]\\w6\\n\\n[half]\\_w[6]\\0\\xちなみに。\\_w[30]\\w6\\n病院に行く際に、\\_w[48]後部座席に光が入らないようにした車に乗ってたんだけど…\\w3。\\_w[168]\\w8\\nこれも変な気分がするから好きだったよ。\\_w[114]\\w6\\n\\n[half]\\_w[6]\\1それは変な子でしたね。\\_w[66]\\w6\\n今でも変な子ですが。\\_w[60]\\w6\\n\\n[half]\\_w[6]\\0\\s[76]精密射撃！\\1\\s[17]うわああぁ――！\\_w[150]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0この前、\\_w[24]変わった事に誘われたよ。\\_w[72]\\w8\\n\\n[half]\\_w[6]\\1ホホゥ。\\_w[24]どんな？\\w6\\_w[24]\\n\\n[half]\\_w[6]\\0格好よくきめたお兄さんだったんだけど、\\_w[114]\\w6\\n「お嬢さん、\\_w[36]一緒にお茶でも育てませんか？」だって。\\_w[114]\\w8\\n\\n[half]\\_w[6]\\1…\\w3…\\w3。\\_w[18]\\w6\\n内容はともかく、\\_w[48]知らない人にほいほいついて行っちゃダメじゃぞ。\\_w[138]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0そ ん な ば か な っ ！\\w8\\_w[69]\\n…\\w3。\\_w[12]\\w8　\\_w[6]\\n…\\w3…\\w3。\\_w[18]\\w8\\n\\n[half]\\_w[6]\\1…\\w3？\\w8　\\_w[18]\\n\\n[half]\\_w[6]\\0\\s[9]七言絶句…\\w3なんて。\\_w[54]\\w6\\n\\n[half]\\_w[6]\\1４点。\\_w[18]\\n\\n[half]\\_w[6]\\0\\s[4]がーん…\\w3。\\_w[30]　\\_w[6]\\e"
      "\\0\\s[0]\\1\\s[10]\\1\\n[half]\\_w[6]\\0極端に暑い時期と極端に寒い時期が別々にあるから、\\_w[144]\\w4エアコンが苦労する事になるんだよ。\\_w[102]\\w6\\n気温、\\_w[18]一年中平均的ならイイのにね。\\_w[84]\\w8\\n\\n[half]\\_w[6]\\1氷雪気候とか熱帯雨林気候のようにか？\\w6\\_w[108]\\n\\n[half]\\_w[6]\\0\\s[4]いや、\\_w[18]そうじゃなくって…\\w3。\\_w[60]\\e"
    ]))
    callback(null, @)
    ###
    @named.setEventListener (ev)=>
      request = new ShioriJK.Message.Request()
      request.request_line.method = "GET"
      request.request_line.protocol = "SHIORI"
      request.request_line.version = "3.0"
      Object.keys(ev).forEach (key)->
        request.headers.set(key, ev[key])
      @ghost.request ""+request, (err, response)->
        if !!err return console.error(err.stack)
        response = new ShioriJK.Message.Request()

        ssp.play(response.get("Value"))

    setTimeout((=>
      request = new ShioriJK.Message.Request()
      request.request_line.method = "GET"
      request.request_line.protocol = "SHIORI"
      request.request_line.version = "3.0"
      request.headers.set("ID", "OnSecondChange")
      @ghost.request ""+request, (err, response)->
        if !!err return console.error(err.stack)
        response = new ShioriJK.Message.Request()

        ssp.play(response.get("Value"))
    ), 1000)
    ###
  # Ikagaka#vanish():void
  vanish: ->
